Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Mechanische Ventile zur Regelung des Flüssigkeitsstroms
en: Valves [mechanical] for regulating fluid flow

source: Kühlapparate für Bohrer [Maschinenteile]
en: Drill cooling apparatus [parts of machines]

source: Bohrstangen
en: Drilling rods

source: Edelgasgeneratoren [Maschinen]
en: Inert gas generators [machines]

source: Absaugturbinen [ausgenommen für Landfahrzeuge]
en: Suction turbines [other than for land vehicles]

source: Bremsen für Industriewaschmaschinen
en: Brakes for industrial washing machines

source: Spritzgeräte [Maschinen] zum Anbringen von künstlichen Sonnenschutzmitteln
en: Sprayers (machines) for applying artificial sun tanning preparations

source: Spritzgeräte [Maschinen] für Haushaltszwecke zum Versprühen von Insektiziden
en: Sprayers [machines] for household use in spraying insecticide

source: Bohrkronen [Werkzeugmaschinen]
en: Core bits [machine tools]

source: Elektrische Moosentferner
en: Power-operated de-thatchers

source: Vertikale Kübelförderbänder mit Riemenbrücken
en: Vertical bucket conveyors incorporating belt bridges

source: Gehäuse für Kugellaufbuchsen
en: Housings for ball bushings

source: Bohrmaschinen [Elektrowerkzeuge]
en: Drill presses [power tools]

source: Elektrisch betriebene Schleifscheiben
en: Power-operated grinding wheels

source: Verbrennungsmotoren, ausgenommen für Landfahrzeuge
en: Internal combustion motors [other than for land vehicles]

source: Elektrische Abfallentsorgungsmaschinen
en: Electric garbage disposal machines

source: Spulen aus Metall [Maschinenteile]
en: Spools of metal [parts of machines]

source: Schlangenbohrer für Elektrowerkzeuge
en: Auger bits for use with powered tools

source: Maschinen zum Zerkleinern
en: Machines for comminuting

source: Führungsrahmen für Schneidwerkzeuge [Maschinen]
en: Guidance frameworks for cutting tools [machine]

source: Hydraulische Ventilbetätiger
en: Hydraulic valve actuators

source: Industrieroboter
en: Industrial robots

source: Lager [Maschinenteile]
en: Bearings [parts of machines]

source: Gelochte Platten als Teile von Maschinen für die Materialsortierung
en: Perforated plates being parts of machines for sorting materials

source: Stapelhebegeräte [Maschinen]
en: Pile raising devices [machines]

source: Ritzel [ausgenommen für Landfahrzeuge]
en: Pinions [other than for land vehicles]

source: Druckmaschinen, ausgenommen für Bürozwecke
en: Printing machines [other than for office use]

source: Ausdehnungstanks [Teile von Fahrzeugkühlern]
en: Expansion tanks [parts of vehicle cooling radiators]

source: Industriebohrmaschinen zum Horizontalbohren
en: Industrial boring machines for horizontal drilling

source: Umfüllmaschinen für industrielle Zwecke
en: Industrial centrifugal decanting machines

source: Flexible Kupplungen [Maschinenteile]
en: Flexible couplings [parts of machines]

source: Fahrbare Bühnen [elektrisch]
en: Mobile platforms [electric]

source: Modulare Maschinenwerkzeuge
en: Modular tools for machines

source: Motorantriebe [ausgenommen für Landfahrzeuge]
en: Motor drive units [other than for land vehicles]

source: Stampfwalzen [Maschinenteile]
en: Tamping rollers [parts of machines]

source: Temperaturregelventile [Maschinenteile]
en: Temperature control valves [parts of machines]

source: Elektrische Pumpen für Teiche
en: Electrical pumps for ponds

source: Gleichgerichtete Kupplungen für Maschinen
en: Undirectional clutches for machines

source: Unterbrechungsfreie Stromversorgungsgeräte [Maschinen] zur Erzeugung von Elektroenergie
en: Uninterruptible power supplies [machines] for the generation of electrical energy

source: Zentrierbohreinheiten als Maschinenteile
en: Centering drilling bits being parts of machines

source: Zerkleinerungsmaschinen für harte Materialien
en: Size reduction machines for hard materials

source: Sortiermaschinen, ausgenommen für Geld
en: Sorting machines, other than for money

source: Linearmotoren
en: Linear motors

source: Klebstreifenspender [Maschinen]
en: Adhesive tape dispensers [machines]

source: Elektrische Motoren und deren Teile, ausgenommen für Landfahrzeuge
en: Electric motors, and their parts, not for land vehicles

source: Wechselstrommotoren für Düsentriebwerke
en: Alternating current motors for jet engines

source: Winkelgelenke [Maschinenteile]
en: Angle joints [parts of machines]

source: Sprüher für Gartenbauzwecke [Maschinenteile]
en: Sprayers for use in horticulture [parts of machines]

source: Stapelmaschinen für Gussblöcke
en: Stacking machines for ingots

source: Standardschaftbohrer [Maschinenteile]
en: Standard shank drills [parts of machines]

source: Sensen [Maschinen]
en: Scythes [machines]

source: Nachbrenner für Luftfahrzeugmotoren
en: Afterburners for air vehicle engines

source: Nachbrenner für Wasserfahrzeugmotoren
en: Afterburners for water vehicle engines

source: Radnaben in Form von Maschinenteilen
en: Wheel hubs being parts of machines

source: Elektrische Werkzeuge mit Bürsten zum Reinigen von Fenstern
en: Window cleaning tools (Electric -) incorporating brushes

source: Sägeblätter für Kreissägen
en: Blades for circular saws

source: Antriebsriemen für Wasserfahrzeuge
en: Drive belts for water vehicles

source: Rüttelmaschinen zum Rütteln von Papier für Stapelungszwecke
en: Jogging machines for vibrating paper for stacking purposes

source: Regler für Motoren
en: Regulators for engines

source: Straßenkehrfahrzeuge [Maschinen]
en: Street sweeping vehicles [machines]

source: Bodenreinigungsroboter [zum Polieren]
en: Robotic cleaning [polishing] machines for floors

source: Elektrische Kompressoren
en: Electric compressors

source: Elektrische Waschgeräte für Nahrungsmittel
en: Machines for washing food [electric]

source: Mit wieder aufladbaren Batterien betriebene Staubsauger
en: Vacuum cleaners powered by rechargeable batteries

source: Kraftbetätigte Ventile
en: Power operated valves

source: Rückschlagventile aus Kunststoff [Maschinenteile]
en: Non-return valves of plastic [parts of machines]

source: Filzscheiben als Maschinenteile zur Verwendung bei Putzarbeiten
en: Non-woven discs being parts of machines for use in cleaning

source: Steuerbare Bohrmaschinen zur Erdversetzung
en: Steerable drilling machinery for earth displacement

source: Werkzeuge für Holzbearbeitungsmaschinen
en: Machine tools for woodworking machines

source: Gangschaltungshebel, ausgenommen für Landfahrzeuge
en: Gear levers other than for land vehicles

source: Getriebemotoren, ausgenommen für Landfahrzeuge
en: Gear motors other than for land vehicles

source: Zahnradgetriebeteile, ausgenommen für Landfahrzeuge
en: Gear train parts, other than for land vehicles

source: Maschinen zum Schleifen von Böden
en: Machines for sanding floors

source: Buchsen für das Verzahnen von Rollenlagern
en: Bushings for the keying of rolling bearings

source: Fleischersägen [Maschinen]
en: Butchers saws [machines]

source: Trennscheiben für Elektrowerkzeuge
en: Discs for cutting for use with power tools

source: Einlassvorrichtungen für Gasturbinen
en: Inlet systems for gas turbines

source: Außenbordmotoren
en: Outboard motors

source: Industriebohrer [Maschinen]
en: Industrial drills [machines]

source: Druckregler zum Schmieren von Anlagen
en: Pressure regulators for lubricating installations

source: Fliesenschneider [Maschinen]
en: Tile cutters [machines]

source: Greifer [Maschinenteile]
en: Grabs [parts of machines]

source: Rotierende Metallschneidwerkzeuge [Maschinen]
en: Rotary metal cutting tools [machines]

source: Maschinen zur Herstellung von Pappe
en: Machines for making cardboard

source: Elektrische Schälmaschinen zur Zubereitung von Nahrungsmitteln
en: Peeling machines (Electric -) for use in the preparation of food

source: Zündkerzen für Fahrzeugmotoren
en: Spark plugs for vehicle engines

source: Miniaturelektrowerkzeuge als Teile von Sets
en: Miniature power tools being parts of sets

source: Motoren für den Modellbau
en: Engines for scale models

source: Kabelschneider [Maschinen]
en: Cable cutters [machines]

source: Dichtungen [Motorenteile]
en: Joints [parts of engines]

source: Pneumatische Ventilbetätiger
en: Pneumatic valve actuators

source: Mechanische Rasenmäher
en: Self-oiling bearings

source: Maschinen für die Zuckerherstellung
en: Machines for the production of sugar

source: Turbinen zur Stromerzeugung
en: Turbines for power generation

source: Maschinen zum Reifenaufpumpen [Werkstatteinrichtungen]
en: Tyre inflating machines [garage installations]

source: Untersetzungsgetriebe, ausgenommen für Landfahrzeuge
en: Reduction gears, other than for land vehicles

source: Polykristalline Diamantfräsen zum Bearbeiten von Werkstücken
en: Polycrystalline diamond cutters for machining of workpieces

source: Flüssigkeitsmixer [Maschinen]
en: Liquid blenders [machines]

source: Verteiler [Maschinen] für Flüssigdünger
en: Liquid manure sliders [machines]

source: Messer [Maschinenteile]
en: Knives [parts of machines]

source: Stoßdämpferkolben [Maschinenteile]
en: Shock absorber plungers [parts of machines]

source: Brennstoffvorrichtungen für Verbrennungsmotoren
en: Fuel systems for internal combustion engines

source: Lochdorne für Lochstanzmaschinen
en: Punches for punching machines

source: Zentrifugalwasserpumpen für Haushaltszwecke
en: Centrifugal water pumps for domestic purposes

source: Strohhäcksler [Maschinen]
en: Chaff cutters [machines]

source: Häckselverteiler [Maschinen]
en: Chaff spreaders [machines]

source: Schneidgitter als Werkzeuge für Schneidmaschinen
en: Cutting grids being tools for cutting machines

source: Schneidspitzen [Maschinenteile]
en: Cutting tips [parts of machines]

source: Schalldämpfer als Teile von Auspuffanlagen
en: Silencers being parts of exhaust systems

source: Schweißpressen in Einständerbauweise
en: Single column welding presses

source: Bits für Bergbaumaschinen
en: Bits for mining machines

source: Extraktionsmaschinen für chemische Verfahren
en: Extracting machines [for chemical processing]

source: Walkmaschinen zum Filzen
en: Felt milling machines

source: Kunststoffbeutel für Staubsauger
en: Bags of plastics for vacuum cleaners

source: Kugellager für Motoren
en: Ball bearings for engines

source: Stoffauflaufkästen als Teile von Papierherstellungsmaschinen
en: Headboxes being parts of paper producing machines

source: Betätigungsmechanismen zum Bedienen von Rudern
en: Actuating mechanisms for controlling rudders

source: Kraftbetätigte Spritzpistolen
en: Power-operated spray guns

source: Seilscheiben [Maschinenteile]
en: Pulleys [parts of machines]

source: Robotermaschinen zur Reinigung von Schwimmbecken
en: Robotic swimming pool cleaning machines

source: Steinbohrer [Werkzeugmaschinen]
en: Rock drills [machine tools]

source: Kipphebel als Maschinenteile
en: Rocker arms [parts of machines]

source: Führungsschienen für Sägen [Maschinenteile]
en: Saw guide rails [parts of machines]

source: Zuführmaschinen für Pressen
en: Feeding machines for presses

source: Zahnkupplungen für Maschinen
en: Gear couplings for machines

source: Dampfmotoren, ausgenommen für Landfahrzeuge
en: Steam engines, other than for land vehicles

source: Zünddrähte für Zündkerzen
en: Spark plug ignition wires

source: Schneeräumgeräte [Maschinen]
en: Snow removal apparatus [machines]

source: Papierzerkleinerungsgeräte, ausgenommen für Bürozwecke
en: Paper shredding machines, other than for office use

source: Stromversorgungsgeräte [Generatoren]
en: Power supply apparatus [generators]

source: Gehäuse für Motoren [Fahrzeugteile]
en: Engine cases [vehicle parts]

source: Elektrische Tierfütterungsmaschinen
en: Electronic feeders for animals

source: Roboter [Maschinen]
en: Robots [machines]

source: Wellenkupplungen, ausgenommen für Landfahrzeuge
en: Shaft couplings, not for land vehicles

source: Stoßdämpfer für Maschinen
en: Shock absorbers for machines

source: Armaturen für Maschinenkessel
en: Fittings for engine boilers

source: Hydraulische Bagger
en: Hydraulic excavators

source: Platten zum Sintern von Pulvermetallen
en: Plates for the sintering of powdered metals

source: Durchgangshähne [Maschinenteile]
en: Plug cocks [parts of machines]

source: Nicht handbetätigte Handwerkzeuge
en: Hand-held tools, other than hand-operated

source: Abzweigrohre aus Metall [Maschinenteile]
en: Metal branching pipes [parts of machines]

source: Metallschneidewerkzeuge [gasbetrieben]
en: Metal cutting tools [gas-operated]

source: Federn [Maschinenteile]
en: Springs [parts of machines]

source: Elektrische Luftdüsenreiniger
en: Air jet cleaners (Electric -)

source: Klammerpatronen für industrielle Heftmaschinen
en: Cartridges of staples for industrial stapling machines

source: Gießereiformen aus Metall [Maschinenteile]
en: Casting moulds of metal [parts of machines]

source: Zylinder für die Schokoladenherstellung
en: Cylinders for use in the manufacture of chocolate

source: Elektrisch erhitzte Lötkolben
en: Electrically heated soldering irons

source: Motoren, ausgenommen für Landfahrzeuge
en: Motors, other than for land vehicles

source: Bürsten [Maschinenteile]
en: Brushes [parts of machines]

source: Siebe zum Sortieren von Kies [Maschinenteile]
en: Screens for grading gravel [parts of machines]

source: Siebe zum Sortieren von Erz [Maschinenteile]
en: Screens for grading ore [parts of machines]

source: Siebe zum Sortieren von Felsen [Maschinenteile]
en: Screens for grading rock [parts of machines]

source: Siebe zur Trennung von Kies [Maschinenteile]
en: Screens for separating gravel [parts of machines]

source: Waschmaschinen für den Haushalt
en: Washing machines for household purposes

source: Schmierpistolen [Maschinen]
en: Lubricating guns [machines]

source: Modelliermaschinen [zur Metallbearbeitung]
en: Shaping machines [for metalworking]

source: Schneidmaschinen [zur Metallbearbeitung]
en: Shearing machines [for metalworking]

source: Sintermaschinen für chemische Verfahren
en: Sintering machines [for chemical processing]

source: Förderer, insbesondere Bandförderer und Rollenbahnen
en: Conveyors, in particular belt conveyors and roller conveyors

source: Zylinder für Fahrzeuge, ausgenommen Landfahrzeuge
en: Cylinders for vehicles other than land vehicles

source: Ventilatoren für Motoren
en: Fans for motors and engines

source: Benzinmotoren, ausgenommen für Landfahrzeuge
en: Gasoline engines not for land vehicles

source: Elektrische Schermaschinen für Vieh
en: Shearers (Electric -) for livestock

source: Elektrische Teigwarenmaschinen für den Haushalt
en: Electric pasta makers for domestic use

source: Abfallzerkleinerer und Abfallpressen [elektrische Müllentsorgungseinheiten]
en: Waste grinders and waste presses [electric waste disposal units]

source: Vorrichtungen zur Emissionsreduzierung von Motoren
en: Emission reduction units for motors and engines

source: Pneumatische Hebezeuge [Maschinen]
en: Pneumatic lifting apparatus [machines]

source: Pneumatisch angetriebene Pressen
en: Pneumatically driven presses

source: Maschinen für die Getränkezubereitung [gewerbliche]
en: Machines for preparing beverages [industrial]

source: Elektrische Bündelmaschinen
en: Tufting tools (Electric -)

source: Steuerseile für Maschinen oder Motoren
en: Control cables for machines, engines or motors

source: Gerätekörbchen für Geschirrspülmaschinen
en: Utensil baskets for dishwashing machines

source: Ölfilter für Motoren und Maschinen
en: Oil filters for motors and engines

source: Schlittensupporte [Maschinenteile]
en: Slide rests [parts of machines]

source: Spulen für Webstühle
en: Bobbins for weaving looms

source: Kraftübertragungsriemen für Maschinen, Motoren und Triebwerke für den gewerblichen Gebrauch
en: Power transmission belts for machines, motors and engines used in industrial applications

source: Enthorner für Rinder
en: Cattle dehorners

source: Zylinderblöcke [Maschinenteile]
en: Cylinder blocks [parts of machines]

source: Membranpumpen zur Förderung von halbflüssigem Material
en: Diaphragm pumps for pumping semi-liquid material

source: Hobelwerkzeuge [Maschinen]
en: Planing tools [machines]

source: Rohreinführmaschinen für industrielle Zwecke
en: Tube insertion machines for industrial use

source: Antriebswellen für Maschinen
en: Transmission shafts for machines

source: Durchlaufwasch- und -bleichmaschinen
en: Continuous scouring and bleaching machines

source: Bremsen für Industriemaschinen
en: Brakes for industrial machines

source: Räummaschinen für die Metallbearbeitung
en: Broaching machines [for metalworking]

source: Kalzinierungsmaschinen für die chemische Verarbeitung
en: Calcining machines [for chemical processing]

source: Garnteil- und -kämmmaschinen
en: Yarn slivering and combing machines

source: Freilaufräder, ausgenommen für Landfahrzeuge
en: Freewheels, other than for land vehicles

source: Spülmaschinen für Pfannen
en: Washing machines for pans

source: Bandsägeblätter für Maschinen
en: Bandsaw blades for machines

source: Stallreiniger [Maschinen]
en: Barn cleaners [machines]

source: Hydraulikantriebe, ausgenommen für Landfahrzeuge
en: Hydraulic transmissions, other than for land vehicles

source: Klingen [Maschinenteile]
en: Blades [parts of machines]

source: Farbwerke für Druckereimaschinen
en: Inking apparatus for printing machines

source: Elektromotoren für Heizungsanlagen
en: Electric motors for heating installations

source: Oberfräsen [Maschinenteile]
en: Routers [parts for machines]

source: Maschinen für die Sackproduktion
en: Machines for the manufacture of sachets

source: Sicherheitskupplungen für Maschinen
en: Safety couplings for machines

source: Breitsämaschinen [traktorgezogene landwirtschaftliche Geräte]
en: Broadcast seeders [tractor towed agricultural implements]

source: Erntemaschinen [traktorgezogene landwirtschaftliche Geräte]
en: Harvesters [tractor towed agricultural implements]

source: Spindelwellen [Maschinenteile]
en: Spindle shafts [parts of machines]

source: Kolbenringe für Wärmepumpen
en: Piston rings for heat pumps

source: Kolben für Verbrennungsmotoren
en: Pistons for internal combustion engines

source: Filter und Beutel für Staubsauger
en: Dust filters and bags for vacuum cleaners

source: Selbstfahrende Arbeitsbühnen
en: Self-propelled working platforms

source: Halbautomatische Stretchmaschinen
en: Semi-automatic stretchwrapping machines

source: Walzwerke [zur Metallbearbeitung]
en: Rolling mills [for metalworking]

source: Numerisch gesteuerte Drehmaschinen
en: Numerically controlled turning machines

source: Ejektoren [Pumpen]
en: Ejectors [pumps]

source: Anlasser für Asynchronelektrokäfigmotoren
en: Starters for asynchronous electric cage motors

source: Anlasserkupplungen für Luftfahrzeuge
en: Starting couplings for air vehicles

source: Anlasserkupplungen für Wasserfahrzeuge
en: Starting couplings for water vehicles

source: Bohrapparate für die Mineralienförderung
en: Drilling apparatus for mineral exploration

source: Halterungen für Bohrmaschinen
en: Drilling machine supports

source: Industriestaubsauger für Reinigungszwecke
en: Industrial vacuum machines for cleaning

source: Tiefenlockerer [Maschinen]
en: Subsoilers [machines]

source: Saugventile für Gaskompressoren
en: Suction valves for gas compressors

source: Supraleitende Magnetabscheider
en: Superconductive magnetic separators

source: Pressmaschinen für die Montage von Hydraulikschläuchen
en: Swaging machines for use in the assembly of hydraulic hoses

source: Formen zum Gießen von Kunststofferzeugnissen [Maschinenteile]
en: Moulds for moulding plastics products [parts of machines]

source: Fahrbare Becherwerke
en: Movable elevator conveyors

source: Fahrbare Schneckenförderer
en: Movable worm conveyors

source: Dampfbetriebene Stromgeneratoren
en: Steam operated power generators

source: Kernspannfutter [Maschinenteile]
en: Core chucks [parts of machines]

source: Aufzüge für Autoparks
en: Vehicle parking carousels

source: Vertikale Kübelförderbänder mit Zufuhrturm
en: Vertical bucket conveyors incorporating delivery towers

source: Gussform für die Produktion [Maschinenteile]
en: Molds for use in the manufacture [machine parts]

source: Elektrische Rasenmäher
en: Electric lawnmowers

source: XY-Positioniertische [Maschinen]
en: Xy positioning tables [machines]

source: Abwickler für Spulen [Maschinen]
en: Spool unwinders [machines]

source: Siebe [elektrisch]
en: Strainers [electric]

source: Elektromotoren mit Getriebe, ausgenommen für Landfahrzeuge
en: Geared electric motors, other than for land vehicles

source: Trägerklammern als Teile von Kraftübertragungsgetrieben
en: Girder clips being parts of power transmission gear

source: Schweißmaschinen für die Schmuckwarenbranche
en: Welding machines for use in the jewellery trade

source: Naß- und Trockenstaubsauger
en: Wet and dry vacuum cleaners

source: Vollautomatische Schleifmaschinen
en: Automatic grinding machines

source: Pumpen für die Entnahme von Flüssigkeiten [Maschinen]
en: Pumps for the extraction of liquids [machines]

source: Stanzpressen zum Vorstanzen von Teilen
en: Punching presses for the pre-punching of parts

source: Antriebe für Aufzugkabinentüren
en: Drives for elevator cabin doors

source: Greiferstangen für Druckmaschinen
en: Gripper bars for use in printing presses

source: Zünddrähte für Kraftfahrzeuge
en: Ignition wires for motor vehicles

source: Verbrennungsmotoren zur Stromerzeugung
en: Internal combustion engines for power generation

source: Perforiermaschinen, ausgenommen für Bürozwecke
en: Perforating machines, other than for office use

source: Druckrahmen [Maschinenteile]
en: Printing frames [parts of machines]

source: Industrielle Reinigungsmaschinen [Staubsauger]
en: Industrial cleaning machines [vacuum cleaners]

source: Flache Pressformen [Maschinenteile]
en: Flat dies [parts of machines]

source: Verteilerblöcke als Teile von Maschinen, Triebwerken oder Motoren
en: Distributor manifolds being parts of machines, engines or motors

source: Elektrische Teigrundungsmaschinen
en: Dough rounding machines (Electric -)

source: Fahrbare Bühnen [hydraulisch]
en: Mobile platforms [hydraulic]

source: Fahrbare Fahrzeughebeapparate
en: Mobile vehicle lifting apparatus

source: Modulare Eierförderbänder
en: Modular egg conveyors

source: Nocken für Motoren
en: Tappets for engines

source: Hähne als maschinell betriebene Werkzeuge
en: Taps being mechanically operated tools

source: Hähne als Teile von Motoren
en: Taps being parts of machines

source: Mischmaschinen für Farben
en: Paint mixing machines

source: Abwickelmaschinen für Blech
en: Uncoiling machines for sheet metal

source: Landwirtschaftliche Sämaschinen
en: Agricultural seed planting machine

source: Zerkleinerungsmaschinen für Gestein
en: Size reduction machines for rock

source: Elektrische Schneidemaschinen für die Küche
en: Slicing machines (Electric -) for kitchen use

source: Schlitzwerkzeuge für Maschinen
en: Slotting tools for machines

source: Pumpen [Maschinen- oder Motorenteile]
en: Pumps [parts of machines, engines or motors]

source: Elektrische Betonverdichter
en: Electric concrete vibrators

source: Elektrische Lüftungsaggregate für Staubsauger
en: Electric fan units for vacuum cleaners

source: Elektrische Schlaghämmer
en: Electric rotary hammers

source: Elektrische Holzsägemaschinen
en: Electric wood saw machines

source: Anschlagdrucker [Maschinen]
en: Impact printers [machines]

source: Ringlochfräsen [Werkzeugmaschinen]
en: Annular hole cutters [machine tools]

source: Antischockpolster [Maschinenteile]
en: Anti-shock pads [parts of machines]

source: Sprüher für landwirtschaftliche Zwecke [Maschinenteile]
en: Sprayers for use in agriculture [parts of machines]

source: Balkensprüher [Maschinen]
en: Spreader beams [machines]
